In [1]:
import pandas as pd

In [2]:
master=pd.read_csv('data/master.csv')

In [3]:
master

      Country name Alpha-2 code ISO3  Numeric code  latitude  longitude  year
0      Afghanistan           AF  AFG             4      33.0       65.0  1960
1      Afghanistan           AF  AFG             4      33.0       65.0  1961
2      Afghanistan           AF  AFG             4      33.0       65.0  1962
3      Afghanistan           AF  AFG             4      33.0       65.0  1963
4      Afghanistan           AF  AFG             4      33.0       65.0  1964
...            ...          ...  ...           ...       ...        ...   ...
16123     Zimbabwe           ZW  ZWE           716     -20.0       30.0  2018
16124     Zimbabwe           ZW  ZWE           716     -20.0       30.0  2019
16125     Zimbabwe           ZW  ZWE           716     -20.0       30.0  2020
16126     Zimbabwe           ZW  ZWE           716     -20.0       30.0  2021
16127     Zimbabwe           ZW  ZWE           716     -20.0       30.0  2022

[16128 rows x 7 columns]

# gdp

In [4]:
income=pd.read_csv('data/gdp_iso3.csv')

In [5]:
income

       Unnamed: 0               country  year  value ISO3
0               0           Afghanistan  1800    583  AFG
1               1                Angola  1800    452  AGO
2               2               Albania  1800    569  ALB
3               3               Andorra  1800   1660  AND
4               4  United Arab Emirates  1800   1390  ARE
...           ...                   ...   ...    ...  ...
58690       58690                 Samoa  2100    16k  WSM
58691       58691                 Yemen  2100   5730  YEM
58692       58692          South Africa  2100  42.7k  ZAF
58693       58693                Zambia  2100  12.8k  ZMB
58694       58694              Zimbabwe  2100   7380  ZWE

[58695 rows x 5 columns]

In [6]:
income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58695 entries, 0 to 58694
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  58695 non-null  int64
 1   country     58695 non-null  object
 2   year        58695 non-null  int64
 3   value       58695 non-null  object
 4   ISO3        55083 non-null  object
dtypes: int64(2), object(3)
memory usage: 2.2+ MB

In [7]:

# 入力ファイル名と出力ファイル名
input_file = 'data/gdp_iso3.csv'
output_file = 'gdp2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [8]:
gdp2=pd.read_csv('gdp2.csv')
gdp2

                    country  year  value ISO3
0               Afghanistan  1800    583  AFG
1                    Angola  1800    452  AGO
2                   Albania  1800    569  ALB
3                   Andorra  1800   1660  AND
4      United Arab Emirates  1800   1390  ARE
...                     ...   ...    ...  ...
58690                 Samoa  2100    16k  WSM
58691                 Yemen  2100   5730  YEM
58692          South Africa  2100  42.7k  ZAF
58693                Zambia  2100  12.8k  ZMB
58694              Zimbabwe  2100   7380  ZWE

[58695 rows x 4 columns]

In [9]:
gdp3 = gdp2.drop('country', axis=1)  # 'B'列を削除
gdp3

# カラムの変更
new_column_names = ['year','gdp','ISO3']
gdp3.columns = new_column_names

# 新しいCSVファイルに書き込む
new_csv_file_path = 'newgdp.csv'
gdp3.to_csv(new_csv_file_path, index=False)

In [10]:
newgdp=pd.read_csv('newgdp.csv')
newgdp

       year    gdp ISO3
0      1800    583  AFG
1      1800    452  AGO
2      1800    569  ALB
3      1800   1660  AND
4      1800   1390  ARE
...     ...    ...  ...
58690  2100    16k  WSM
58691  2100   5730  YEM
58692  2100  42.7k  ZAF
58693  2100  12.8k  ZMB
58694  2100   7380  ZWE

[58695 rows x 3 columns]

# pop

In [11]:
pop=pd.read_csv('data/pop_iso3.csv')

In [12]:
pop

       Unnamed: 0               country  year  value ISO3
0               0           Afghanistan  1800  3.28M  AFG
1               1                Angola  1800  1.57M  AGO
2               2               Albania  1800   400k  ALB
3               3               Andorra  1800   2650  AND
4               4  United Arab Emirates  1800  40.2k  ARE
...           ...                   ...   ...    ...  ...
59292       59292                 Samoa  2100   441k  WSM
59293       59293                 Yemen  2100  74.2M  YEM
59294       59294          South Africa  2100  74.6M  ZAF
59295       59295                Zambia  2100  63.6M  ZMB
59296       59296              Zimbabwe  2100  35.6M  ZWE

[59297 rows x 5 columns]

In [13]:


# 入力ファイル名と出力ファイル名
input_file = 'data/pop_iso3.csv'
output_file = 'pop2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [14]:
pop2=pd.read_csv('pop2.csv')
pop2

                    country  year  value ISO3
0               Afghanistan  1800  3.28M  AFG
1                    Angola  1800  1.57M  AGO
2                   Albania  1800   400k  ALB
3                   Andorra  1800   2650  AND
4      United Arab Emirates  1800  40.2k  ARE
...                     ...   ...    ...  ...
59292                 Samoa  2100   441k  WSM
59293                 Yemen  2100  74.2M  YEM
59294          South Africa  2100  74.6M  ZAF
59295                Zambia  2100  63.6M  ZMB
59296              Zimbabwe  2100  35.6M  ZWE

[59297 rows x 4 columns]

In [15]:
pop3 = pop2.drop('country', axis=1)  # 'B'列を削除
pop3

# カラムの変更
new_column_names = ['year','pop','ISO3']
pop3.columns = new_column_names

# 新しいCSVファイルに書き込む
new_csv_file_path = 'newpop.csv'
pop3.to_csv(new_csv_file_path, index=False)

In [16]:
newpop=pd.read_csv('newpop.csv')
newpop

       year    pop ISO3
0      1800  3.28M  AFG
1      1800  1.57M  AGO
2      1800   400k  ALB
3      1800   2650  AND
4      1800  40.2k  ARE
...     ...    ...  ...
59292  2100   441k  WSM
59293  2100  74.2M  YEM
59294  2100  74.6M  ZAF
59295  2100  63.6M  ZMB
59296  2100  35.6M  ZWE

[59297 rows x 3 columns]

# life

In [17]:
life=pd.read_csv('data/life_iso3.csv')

In [18]:
life

       Unnamed: 0               country  year  value ISO3
0               0           Afghanistan  1800   28.2  AFG
1               1                Angola  1800   27.0  AGO
2               2               Albania  1800   35.4  ALB
3               3               Andorra  1800    NaN  AND
4               4  United Arab Emirates  1800   30.7  ARE
...           ...                   ...   ...    ...  ...
58690       58690                 Samoa  2100   80.8  WSM
58691       58691                 Yemen  2100   78.0  YEM
58692       58692          South Africa  2100   77.7  ZAF
58693       58693                Zambia  2100   77.1  ZMB
58694       58694              Zimbabwe  2100   74.4  ZWE

[58695 rows x 5 columns]

In [19]:

# 入力ファイル名と出力ファイル名
input_file = 'data/life_iso3.csv'
output_file = 'life2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [20]:
life2=pd.read_csv('life2.csv')
life2

                    country  year  value ISO3
0               Afghanistan  1800   28.2  AFG
1                    Angola  1800   27.0  AGO
2                   Albania  1800   35.4  ALB
3                   Andorra  1800    NaN  AND
4      United Arab Emirates  1800   30.7  ARE
...                     ...   ...    ...  ...
58690                 Samoa  2100   80.8  WSM
58691                 Yemen  2100   78.0  YEM
58692          South Africa  2100   77.7  ZAF
58693                Zambia  2100   77.1  ZMB
58694              Zimbabwe  2100   74.4  ZWE

[58695 rows x 4 columns]

In [21]:
life3 = life2.drop('country', axis=1)  # 'B'列を削除
life3

       year  value ISO3
0      1800   28.2  AFG
1      1800   27.0  AGO
2      1800   35.4  ALB
3      1800    NaN  AND
4      1800   30.7  ARE
...     ...    ...  ...
58690  2100   80.8  WSM
58691  2100   78.0  YEM
58692  2100   77.7  ZAF
58693  2100   77.1  ZMB
58694  2100   74.4  ZWE

[58695 rows x 3 columns]

In [22]:
# カラムの変更
new_column_names = ['year','life span','ISO3']
life3.columns = new_column_names

In [23]:
life3

       year  life span ISO3
0      1800       28.2  AFG
1      1800       27.0  AGO
2      1800       35.4  ALB
3      1800        NaN  AND
4      1800       30.7  ARE
...     ...        ...  ...
58690  2100       80.8  WSM
58691  2100       78.0  YEM
58692  2100       77.7  ZAF
58693  2100       77.1  ZMB
58694  2100       74.4  ZWE

[58695 rows x 3 columns]

In [24]:
# 新しいCSVファイルに書き込む
new_csv_file_path = 'newlife.csv'
life3.to_csv(new_csv_file_path, index=False)

In [25]:
newlife=pd.read_csv('newlife.csv')
newlife

       year  life span ISO3
0      1800       28.2  AFG
1      1800       27.0  AGO
2      1800       35.4  ALB
3      1800        NaN  AND
4      1800       30.7  ARE
...     ...        ...  ...
58690  2100       80.8  WSM
58691  2100       78.0  YEM
58692  2100       77.7  ZAF
58693  2100       77.1  ZMB
58694  2100       74.4  ZWE

[58695 rows x 3 columns]

# mental

In [26]:
#mental=pd.read_csv('data/mental_iso3.csv')

In [27]:
#mental

In [28]:
continent=pd.read_csv('data/continent.csv')

In [29]:
continent

                  Country name ISO3 Continent
0                  Afghanistan  AFG      Asia
1                Åland Islands  ALA    Europe
2                      Albania  ALB    Europe
3                      Algeria  DZA    Africa
4               American Samoa  ASM   Oceania
..                         ...  ...       ...
244  Wallis and Futuna Islands  WLF   Oceania
245             Western Sahara  ESH    Africa
246                      Yemen  YEM      Asia
247                     Zambia  ZMB    Africa
248                   Zimbabwe  ZWE    Africa

[249 rows x 3 columns]

In [30]:
master=master.merge(continent,on=['ISO3'],how='left')

In [31]:
master = master.merge(newlife,on=['year','ISO3'],how='left')
#master=master.merge(mental,on=['ISO3','ISO3'],how='left')
master=master.merge(newpop,on=['year','ISO3'],how='left')
master=master.merge(newgdp,on=['year','ISO3'],how='left')

In [35]:
master

,Country name_x,Alpha-2 code,ISO3,Numeric code,latitude,longitude,year,Country name_y,Continent,life span,pop,gdp
0,Afghanistan,AF,AFG,4,33.0,65.0,1960,Afghanistan,Asia,45.0,8.62M,1920
1,Afghanistan,AF,AFG,4,33.0,65.0,1961,Afghanistan,Asia,45.3,8.79M,1900
2,Afghanistan,AF,AFG,4,33.0,65.0,1962,Afghanistan,Asia,45.5,8.97M,1890
3,Afghanistan,AF,AFG,4,33.0,65.0,1963,Afghanistan,Asia,45.7,9.16M,1890
4,Afghanistan,AF,AFG,4,33.0,65.0,1964,Afghanistan,Asia,45.9,9.36M,1880
...,...,...,...,...,...,...,...,...,...,...,...,...
16123,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2018,Zimbabwe,Africa,60.6,15.1M,2400
16124,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2019,Zimbabwe,Africa,61.0,15.4M,2200
16125,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2020,Zimbabwe,Africa,60.7,15.7M,1990
16126,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2021,Zimbabwe,Africa,61.5,16M,2120
16127,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2022,Zimbabwe,Africa,61.7,16.3M,2130

In [36]:
master0 = master.drop('Country name_y', axis=1)  # 'B'列を削除
master0

,Country name_x,Alpha-2 code,ISO3,Numeric code,latitude,longitude,year,Continent,life span,pop,gdp
0,Afghanistan,AF,AFG,4,33.0,65.0,1960,Asia,45.0,8.62M,1920
1,Afghanistan,AF,AFG,4,33.0,65.0,1961,Asia,45.3,8.79M,1900
2,Afghanistan,AF,AFG,4,33.0,65.0,1962,Asia,45.5,8.97M,1890
3,Afghanistan,AF,AFG,4,33.0,65.0,1963,Asia,45.7,9.16M,1890
4,Afghanistan,AF,AFG,4,33.0,65.0,1964,Asia,45.9,9.36M,1880
...,...,...,...,...,...,...,...,...,...,...,...
16123,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2018,Africa,60.6,15.1M,2400
16124,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2019,Africa,61.0,15.4M,2200
16125,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2020,Africa,60.7,15.7M,1990
16126,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2021,Africa,61.5,16M,2120
16127,Zimbabwe,ZW,ZWE,716,-20.0,30.0,2022,Africa,61.7,16.3M,2130

ここより下はマージじゃなくてデータの並び替え

In [32]:
import pandas as pd

# 同じ階層に変換したいデータを配置
# pop.csvは読み込むファイル名
df = pd.read_csv('data/pop.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'pop_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)

In [33]:
df = pd.read_csv('data/gdp_pcap.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'gdp_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)

In [34]:
df = pd.read_csv('data/life ex.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'life_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)